cfg/InformationRegisters/ПереводыТекстов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПереводыТекстов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстUK</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХешRU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХешUK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ПереводыТекстов/Forms/ФормаСписка/Ext/Form/Module.bsl
Процедура ПриОткрытии()
	
	// устанавливаем возможность сортировки
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.ХешRU.Доступность    = Истина;
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.ТекстRU.Доступность  = Истина;
	ЭлементыФормы.РегистрСведенийСписок.НастройкаПорядка.ТекстUK.Доступность  = Истина;
	
КонецПроцедуры // ПриОткрытии()

Процедура ДействияФормыПерезаполнитьПоМакету(Кнопка)
	Локализация.ОбновитьРегистрСведенийПереводыТекстовИзМакетаНачальногоЗаполнения();
КонецПроцедуры // ДействияФормыПерезаполнитьПоМакету

Процедура ДействияФормыОбновитьХеши(Кнопка)
	Локализация.ОбновитьХешиРегистраСведенийПереводыТекстов();
КонецПроцедуры // ДействияФормыОбновитьХеши

Процедура ДействияФормыЗагрузитьТекстыИзМетаданных(Кнопка)
	Локализация.ЗагрузитьТекстыИзМетаданных();
КонецПроцедуры // ДействияФормыЗагрузитьТекстыИзМетаданных

Процедура ДействияФормыВывестиНовые(Кнопка)
	
	Макет = РегистрыСведений.ПереводыТекстов.ПолучитьМакет("НачальноеЗаполнение");
	КоличествоЗаписей = Макет.ВысотаТаблицы;
	ОбластьРесурсов = Макет.ПолучитьОбласть("Ресурсы");
	
	ТаблицаМакета = Новый ТаблицаЗначений;
	
	ТаблицаМакета.Колонки.Добавить("ТекстRU");
	
	Для Сч = 2 По КоличествоЗаписей Цикл
		
		ТекстRU = СокрЛП(ОбластьРесурсов.Область(Сч, 1).Текст);
		// ТекстUK = СокрЛП(ОбластьРесурсов.Область(Сч, 2).Текст);
		
		НоваяСтрока = ТаблицаМакета.Добавить();
		
		НоваяСтрока.ТекстRU = ТекстRU;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	| 	ПереводыТекстов.ТекстRU КАК ТекстRU
	|ИЗ 
	|	РегистрСведений.ПереводыТекстов КАК ПереводыТекстов
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТаблицаМакета.Найти(Выборка.ТекстRU, "ТекстRU") = Неопределено Тогда
			Сообщить(Выборка.ТекстRU);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры // ДействияФормыВывестиНовые
